{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential","layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,1000],"dtype":"float32","sparse":false,"name":"embedding_input"}},{"class_name":"Embedding","config":{"input_dim":231873,"output_dim":100,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":false,"input_length":1000,"name":"embedding","trainable":false,"batch_input_shape":[null,1000],"dtype":"float32"}},{"class_name":"LSTM","config":{"name":"lstm","trainable":true,"units":4,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},{"class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense","trainable":true}}]},"keras_version":"tfjs-layers 3.15.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"lstm/kernel","shape":[100,16],"dtype":"float32"},{"name":"lstm/recurrent_kernel","shape":[4,16],"dtype":"float32"},{"name":"lstm/bias","shape":[16],"dtype":"float32"},{"name":"dense/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense/bias","shape":[1],"dtype":"float32"},{"name":"embedding/embeddings","shape":[231873,100],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.15.0","convertedBy":null}